'use strict'

// Завдання 1

let userName=prompt('Як Ваше ім\'я?');
alert('Привіт, '+userName);


// ***********************************************
// Завдання 2

// const year=2023
// let yearBirth=+prompt('Щоб дізнатися скільки Вам років, вкажіть у якому році Ви народились?');
// alert(year-yearBirth);


// ***********************************************
// Завдання 3

// let a=+prompt('Вкажіть довжину сторони квадрату.');
// alert('Периметр квадрату складає - '+a*4);


// ***********************************************
// Завдання 4

// let r=+prompt('Вкажіть радіус кола.');
// alert('Площа кола складає - '+Math.PI*r**2);


// ***********************************************
// Завдання 5

// let a=+prompt('Яка відстань у кілометрах, між двома містами?');
// let b=+prompt('Вкажіть час, за який Вам необхідно дістатися міста.');
// alert('Вам необхідно рухатись зі швидкістю - '+Math.round(a/b)+' км/год');


// ***********************************************
// Завдання 6

// const rate=0.95
// let d=+prompt('Скільки долларів Ви бажаєте обміняти');
// alert('Ви отримаєте '+(d*rate).toFixed(2)+' євро');


// ***********************************************
// Завдання 7

// let a=+prompt('Вкажіть обсяг флешки у ГБ');
// alert('На цю флешку вміститься '+Math.floor(a*1024/820)+' файлів розміром 820 МБ.');


// ***********************************************
// Завдання 8

// let sum=+prompt('Скільки у Вас грошей?');
// let price=+prompt('Введіть вартість однієї шоколадки');
// alert(`Ви можете купити шоколадки у кількості ${Math.floor(sum/price)} шт. і отримати ${(sum%price).toFixed(2)} грн. решти`);


// ***********************************************
// Завдання 9
// Варіант 1

// let nam=+prompt('Введіть тризначне число, щоб дізнатися чи є це число поліндромом.');
// alert(nam%10==Math.floor(nam/100));

// Варіант 2

// let nam=+prompt('Введіть тризначне число, щоб дізнатися чи є це число поліндромом.');
// let a=nam%10==Math.floor(nam/100) ? 'Поліндром' : 'Не поліндром';
// alert(a);


// ***********************************************
// Завдання 10
// Варіант 1

// let nam=+prompt('Введіть ціле число, щоб дізнатися чи є це число парним.');
// alert(nam%2==0);

// Варіант 2

// let nam=+prompt('Введіть ціле число, щоб дізнатися чи є це число парним.');
// let a=nam%2==0 ? 'Парне' : 'Непарне';
// alert(a);